Repository: ishandutta0098/fuzzy-expert
Catalog: sphinx/locale/*/LC_MESSAGES/index.po
Languages: es

source: Fuzzy-Expert: Mamdani Fuzzy Inference Systems in Python
es: Fuzzy-Expert: Sistemas de Inferencia Borrosa de Zadeh-Mamdani en Python

source: **What is it?**
es: **¿Qué es?**

source: **Fuzzy-Expert** is a Python package for building Mamdani Fuzzy Inference Systems. **Fuzzy-Expert** admits a mix of fuzzy and crisp values and associated certainty values. The inference system returns crisp values and certainty factors for the conclusions of the rules.
es: **Fuzzy-Expert** es un paquete de Python para construir Sistemas de Inferencia Borrosa de Zadeh-Mamdani. **Fuzzy-Expert** admite una combinación de valores difusos y concretos yvalores de certeza asociados. El sistema de inferencia devuelve valores concretos y factores de certeza para las conclusiones de las reglas.

source: **Main Features**
es: **Principales Características**

source: Specification of membership functions using standard functions or as a list of points.
es: Especificación de funciones de pertenencia mediante funciones estándar o como una lista de puntos.

source: Different functions for specifying T-norms and Conorms.
es: Diferentes funciones para especificar T-normas y Conormas.

source: Different implication operators.
es: Diferentes operadores de implicación.

source: Composition using `max-min` or `max-prod` rules.
es: Composición usando las reglas` max-min` o `max-prod`.

source: Most common functions for production aggregation.
es: Diferentes operadores para desfuzzificar conjuntos borrosos.

source: **Release Information**
es: **Información de la Publicación**

source: Date: June 24, 2021 **Version**: 0.1.0
es: Fecha: Junio 24, 2021 **Version**: 0.1.0

source: Binary Installers: `<https://pypi.org/project/fuzzy_expert>`_
es: Instaladores binarios: `<https://pypi.org/project/fuzzy_expert>`_

source: Source Repository: `<https://github.com/jdvelasq/fuzzy-expert>`_
es: Repositorio fuente: `<https://github.com/jdvelasq/fuzzy-expert>`_

source: Documentation: `<https://jdvelasq.github.io/fuzzy-expert/>`_
es: Documentacion: `<https://jdvelasq.github.io/fuzzy-expert/>`_
