Repository: ishandutta0098/fuzzy-expert
Catalog: sphinx/locale/*/LC_MESSAGES/mf.po
Languages: es

source: Membership Functions
es: Funciones de pertenencia

source: Functions in this module returns a standard membership function specificaion as a list of points (x_i, u_i).
es: Las funciones de este módulo devuelven una especificación de función de pertenencia estándar como una lista de puntos (x_i, u_i).

source: Membership function constructor.
es: Constructor de funciones de pertenencia.

source: Parameters
es: Parámetros

source: Number base point for building the approximations.
es: Número de puntos base para construuir las aproximaciones.

source: Gaussian membership function.
es: Función de pertenencia gaussiana.

source: Defines the center of the membership function.
es: Define el centro de la función de pertenencia.

source: Defines the width of the membership function, where a larger value creates a wider membership function.
es: Define el ancho de la función de pertenencia, donde un valor más grande crea una función de pertenencia más ancha.

source: Return type
es: Tipo retornado

source: Generalized bell-shaped membership function.
es: Función de pertenencia de campana generalizada.

source: Defines the shape of the curve on either side of the central plateau, where a larger value creates a more steep transition.
es: Define la forma de la curva a cada lado de la meseta central, donde un valor mayor crea una transición más pronunciada.

source: Pi-shaped membership function.
es: Función de pertenencia en forma de pi.

source: Defines the left peak of the membership function.
es: Define el pie izquierdo de la función de pertenencia.

source: Defines the right peak of the membership function.
es: Define el pico derecho de la función de pertenencia.

source: Defines the right feet of the membership function.
es: Define el pie derecho de la función de pertenencia.

source: Sigmoidal membership function.
es: Función de pertenencia sigmoidal.

source: Defines the width of the membership function.
es: Define el ancho de la función de pertenencia.

source: S-shaped membership function.
es: Función de pertenencia en forma de S.

source: Defines the foot of the membership function.
es: Define el pie de la función de pertnencia.

source: Defines the shoulder of the membership function.
es: Define el hombro de la función de pertenencia.

source: Trapezoidal membership function.
es: Función de pertenencia trapezoidal.

source: Triangular membership function.
es: Función de pertnencia triangular.

source: Defines the peak of the membership function.
es: Define el pico de la función de pertenencia.

source: Z-shaped membership function.
es: Función de pertenencia en forma de Z.

source: Defines the feet of the membership function.
es: Define el pie de la función de pertenencia.
