Repository: ishandutta0098/fuzzy-expert
Catalog: sphinx/locale/*/LC_MESSAGES/operators.po
Languages: es

source: Modifiers and operators
es: Modificadores y operadores

source: Apply a list of modifiers or hedges to a numpy array.
es: Aplica una lista de modificadores a un vector NumPy.

source: Parameters
es: Parámetros

source: Membership values to be modified.
es: Valores de pertenencia a ser modificados.

source: List of modifiers or hedges.
es: Lista de modificadores.

source: Return type
es: Tipo retornado

source: Applies the element-wise function max(0, u - v).
es: Aplica la función elemental max(0, u - v).

source: List of arrays of membership values.
es: Lista de vectores de valores de pertenencia.

source: Applies the element-wise function max(0, u + v - 1).
es: Aplica la función elemental max(0, u + v - 1).

source: Applies the element-wise function min(1, u + v).
es: Aplica la función elemental min(1, u + v).

source: Computes a representative crisp value for the fuzzy set.
es: Computa un valor concreto representantivo del conjunto borroso

source: Array of values representing the universe of discourse.
es: Vector de valores representando el universo de discurso.

source: Array of values representing the membership function.
es: Vector de valores que representan la función de pertenencia

source: Method used for computing the crisp representative value of the fuzzy set. * `"cog"`: Center of gravity. * `"boa"`: Bisector of area. * `"mom"`: Mean of the values for which the membership function is maximum. * `"lom"`: Largest value for which the membership function is maximum. * `"som"`: Smallest value for which the membership function is minimum.
es: Método usado para calcular el valor concreto representativo de conjunto borroso. * `"cog"`: Centro de gravedad. * `"boa"`: Bisector del area. * `"mom"`: Media de los valores para los cuales la función de pertenencia es máxima. * `"lom"`: Valor más grande de los valores para los cuales la función de pertenencia es máxima. * `"som"`: Valor más pequeño de los valores para los cuales la función de pertenencia es máxima.

source: Method used for computing the crisp representative value of the fuzzy set.
es: Método usado para calcular el valor concreto representativo del conjunto borroso.

source: `"cog"`: Center of gravity.
es: `"cog"`: Centro de gravedad.

source: `"boa"`: Bisector of area.
es: `"boa"`: Bisector del area.

source: `"mom"`: Mean of the values for which the membership function is maximum.
es: `"mom"`: Media de los valores para los cuales la función de pertenencia es máxima.

source: `"lom"`: Largest value for which the membership function is maximum.
es: `"lom"`: Valor más grande de los valores para los cuales la función de pertenencia es máxima.

source: `"som"`: Smallest value for which the membership function is minimum.
es: `"som"`: Valor más pequeño de los valores para los cuales la función de pertenencia es máxima.

source: Applies the element-wise function f(u, v) = u if v == 0 else v if u == 1 else 0.
es: Aplica la función elemental f(u, v) = u if v == 0 else v if u == 1 else 0.

source: Applies the element-wise function f(u, v) = u if v == 0 else v if u == 0 else 1.
es: Aplica la función elemental f(u, v) = u if v == 0 else v if u == 0 else 1.

source: Applies the element-wise function fn(u) = u^3.
es: Aplica la función elemental fn(u) = u^3.

source: Membership function to be modified.
es: Función de pertenencia a ser modificada.

source: Applies the element-wise function fn(u) = u^2 if u <= 0.5 else 1 - 2 * (1 - u)^2.
es: Aplica la función elemental fn(u) = u^2 if u <= 0.5 else 1 - 2 * (1 - u)^2.

source: Applies the element-wise function fn(u, v) = max(u, v).
es: Aplica la función elemental fn(u, v) = max(u, v).

source: Applies the element-wise function f(u, v) = min(u, v).
es: Aplica la función elemental f(u, v) = min(u, v).

source: Applies the element-wise function fn(u) = u^(1/2).
es: Aplica la función elemental fn(u) = u^(1/2).

source: Applies the element-wise function fn(u) = u / max(u).
es: Aplica la función elemental fn(u) = u / max(u).

source: Applies the element-wise function fn(u) = 1 - u.
es: Aplica la función elemental fn(u) = 1 - u.

source: Applies the element-wise function fn(u) = u^1.25.
es: Aplica la función elemental fn(u) = u^1.25.

source: Applies the element-wise function fn(u, v) = u + v - u * v. Also known as algebraic-sum.
es: Aplica la función elemental fn(u, v) = u + v - u * v. También conocida como algebraic-sum.

source: Applies the element-wise function fn(u, v) = u * v.
es: Aplica la función elemental fn(u, v) = u * v.

source: Applies the element-wise function fn(u) = u^(1/2).
es: Aplica la función elemental fn(u) = u^(1/2).

source: Applies the element-wise function fn(u) = u^(1/3).
es: Aplica la función elemental fn(u) = u^(1/3).

source: Applies the element-wise function fn(u) = u^2.
es: Aplica la función elemental fn(u) = u^2.
