Repository: ishandutta0098/fuzzy-expert
Catalog: sphinx/locale/*/LC_MESSAGES/variable.po
Languages: es

source: Fuzzy Variables
es: Variables difusas

source: Creates a fuzzy variable.
es: Crea una variable difusa.

source: Parameters
es: Parámetros

source: Limits of the universe of discourse.
es: Límites del universo de discurso.

source: Dictionary where each term is the key of the dictionary, and the values is the membership function.
es: Diccionario donde cada término es la clave del diccionario y los valores son la función de pertenencia.

source: Value controling the resolution for the discrete representation of the universe.
es: Valor que controla la resolución de la representación discreta del universo.

source: Return type
es: Tipo retornado

source: Returns the membership modified values for the term.
es: Devuelve los valores modificados de pertenencia para el término.

source: Name of the fuzzy set.
es: Nombre del conjunto difuso.

source: List of modifiers.
es: Lista de modificadores.

source: Plots a fuzzy variable.
es: Grafica la variable difusa.

source: Format string passed to Matplotlib.pyplot.
es: Cadena de formato pasada a Matplotlib.pyplot.

source: Width of lines.
es: Ancho de las lineas.

source: Plots the fuzzy set, and the input.
es: Grafica el conjunto borroso y la entrada.

source: Crisp or fuzzy input value.
es: Valor de entrada difuso o concreto.

source: Term to plot.
es: Término a graficar.

source: Draw the x-axis of plot
es: Dibuja el eje-X de la gráfica.

source: Draw the y-axis of plot at left or right side.
es: Dibuja el eje-Y de la gráfica a la izquierda o a la derecha.
