Repository: ishandutta0098/fuzzy-expert
Catalog: sphinx/locale/*/LC_MESSAGES/tutorials/tutorial-1.po
Languages: es

source: Tutorial 1 - Bank decision loan problem with crisp inputs
es: Tutorial 1 - Problema bancario de decisión de préstamos con entradas concretas

source: In this tutorial a fuzzy inference system for loan approbation is builded. The problem has three input variables: score, ratio, and credit; and one output variable: decision.
es: En este tutorial se construye un sistema de inferencia difuso para la aprobación de préstamos.

source: Variable specification
es: Especificación de las variables

source: In the following code, a dictionary containing the variables of the problem is defined. The keys of the dictionary are the names of the variables in the rules. For each variable is defined the limits of the universe of discourse, the terms, and the membership function for each term. Finally, the variable ``score`` is ploted.
es: En el siguiente código se define un diccionario que contiene las variables del problema. Las claves del diccionario son los nombres de las variables en las reglas. Para cada variable se definen los límites del universo deldiscurso, los términos y la función de pertenencia para cada término. Finalmente, se grafica la variable `score`.

source: Rule specification
es: Especificación de las reglas

source: The fuzzy inference system has two rules. They are directly stored in a list.
es: El sistema de inferencia difusa tiene dos reglas. Ellas se almacenan directamente en una lista.

source: Inference system specification and computations
es: Especificación del sistema de inferencia y cálculos

source: Finally, the fuzzy inference system is specified. The model is used to evaluate the following crisp values for the input variables: ``score=190``, ``ratio=0.39``, and ``credit=1.5``. The model returns a dictionary with the values of the variables in the consequence of the rules and the certainty factor of the conclusion.
es: Finalmente, se especifica el sistema de inferencia difusa. El modelo se utiliza para evaluar los siguientes valores concretos para las variables de entrada: `score=190`, `ratio=0.39` y `credit=1.5`. El modelo devuelve un diccionario con los valores de las variables en el consecuente de las reglas y el factor de certeza de la conclusión.

source: Visualization of the results
es: Visualización de los resultados

source: The function plot can be used to obtain a graphical represntation of the results of the inference systems. It uses the same parameters used to the evaluation of the system.
es: La función `plot` se puede utilizar para obtener una representación gráfica de los resultados de los sistemas de inferencia. Utiliza los mismos parámetros utilizados para la evaluación del sistema.

source: User interaction
es: Interación con el usuario

source: Using the ``ipywidgets`` package in Jupyter Lab it is possible to obtain an interactive user interface for the user. The funtion ``demo`` is used to plot the results; following, the function ``interact`` is used to create the user interface.
es: Usando el paquete `ipywidgets` en Jupyter Lab es posible obtener una interfaz de usuario interactiva para el usuario. La función `demo` se utiliza para trazar los resultados. A continuación, la función `interact` se utiliza para crear la interfaz de usuario.
